#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

aws_api_gateway_api_key.main: Refreshing state... [id=0iz5rl9ff4]
data.aws_iam_policy_document.core_rendering_c4_secret: Reading...
aws_api_gateway_rest_api.this: Refreshing state... [id=hl6yp94sy9]
aws_api_gateway_domain_name.this: Refreshing state... [id=api.stage.diagramastext.dev]
data.aws_iam_policy_document.core_rendering_c4_secret: Read complete after 0s [id=2412329430]
aws_iam_policy.core_rendering_c4_secret: Refreshing state... [id=arn:aws:iam::027889758114:policy/LambdaCoreRenderingC4-stg]
module.core_rendering_c4.aws_cloudwatch_log_group.logs: Refreshing state... [id=/aws/lambda/core-rendering-c4-stg]
module.core_rendering_c4.null_resource.this: Refreshing state... [id=5911690965036928812]
module.core_rendering_c4.data.aws_iam_policy_document.logs: Reading...
module.core_rendering_c4.data.aws_iam_policy_document.logs: Read complete after 0s [id=3830842054]
module.core_rendering_c4.aws_iam_role.this: Refreshing state... [id=LambdaRolecore-rendering-c4-stg]
module.core_rendering_c4.aws_iam_policy.logs: Refreshing state... [id=arn:aws:iam::027889758114:policy/LambdaPolicyLogs-core-rendering-c4-stg]
aws_cloudwatch_log_group.gw: Refreshing state... [id=API-Gateway-Execution-Logs_hl6yp94sy9]
aws_api_gateway_request_validator.this: Refreshing state... [id=tq63jc]
aws_api_gateway_resource.route_top["c4"]: Refreshing state... [id=xieiwr]
aws_api_gateway_model.schema_response: Refreshing state... [id=2wvhiv]
aws_api_gateway_model.schema_request: Refreshing state... [id=h6ryy8]
aws_api_gateway_method.options["c4"]: Refreshing state... [id=agm-hl6yp94sy9-xieiwr-OPTIONS]
aws_api_gateway_method.this["c4-POST"]: Refreshing state... [id=agm-hl6yp94sy9-xieiwr-POST]
aws_api_gateway_integration.options["c4"]: Refreshing state... [id=agi-hl6yp94sy9-xieiwr-OPTIONS]
aws_api_gateway_integration_response.options["c4"]: Refreshing state... [id=agir-hl6yp94sy9-xieiwr-OPTIONS-200]
aws_api_gateway_method_response.options["c4"]: Refreshing state... [id=agmr-hl6yp94sy9-xieiwr-OPTIONS-200]
aws_api_gateway_method_response.this["c4-POST"]: Refreshing state... [id=agmr-hl6yp94sy9-xieiwr-POST-200]
aws_api_gateway_integration_response.this["c4-POST"]: Refreshing state... [id=agir-hl6yp94sy9-xieiwr-POST-200]
module.core_rendering_c4.aws_iam_role_policy_attachment.logs: Refreshing state... [id=LambdaRolecore-rendering-c4-stg-20230226133156203900000002]
module.core_rendering_c4.aws_iam_role_policy_attachment.custom["arn:aws:iam::027889758114:policy/LambdaCoreRenderingC4-stg"]: Refreshing state... [id=LambdaRolecore-rendering-c4-stg-20230226133156196600000001]
module.core_rendering_c4.aws_lambda_function.this: Refreshing state... [id=core-rendering-c4-stg]
aws_api_gateway_integration.this["c4-POST"]: Refreshing state... [id=agi-hl6yp94sy9-xieiwr-POST]
aws_lambda_permission.gw["c4-POST"]: Refreshing state... [id=InvokeGWMain-c4-POST]
aws_api_gateway_deployment.this: Refreshing state... [id=j414vd]
aws_api_gateway_stage.this: Refreshing state... [id=ags-hl6yp94sy9-base]
aws_api_gateway_usage_plan.test: Refreshing state... [id=4v5ye3]
aws_api_gateway_base_path_mapping.this: Refreshing state... [id=api.stage.diagramastext.dev/]
aws_api_gateway_usage_plan_key.main: Refreshing state... [id=0iz5rl9ff4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2023-03-03T13:24:42Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-2:027889758114:hl6yp94sy9/" -> (known after apply)
      ~ id            = "j414vd" -> (known after apply)
      ~ invoke_url    = "https://hl6yp94sy9.execute-api.us-east-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "548f3294e65ec7cb1053a9ac5fd3d953e17dd2cc" -> "11125b98d96fce025228fc6c946b93ce978f1b3f"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "j414vd" -> (known after apply)
        id                    = "ags-hl6yp94sy9-base"
        tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.core_rendering_c4.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "/Users/dkisler/projects/diagramastext/server/core/deployment/modules/lambda/bin/core-rendering-c4-stg-a72acfbf114d8a651464729463f105dd.zip" -> "/home/runner/work/diagramastext/diagramastext/server/core/deployment/modules/lambda/bin/core-rendering-c4-stg-fc3cebc41b753c676d33484b14b51d60.zip"
        id                             = "core-rendering-c4-stg"
      ~ last_modified                  = "2023-03-03T13:24:35.000+0000" -> (known after apply)
      + skip_destroy                   = false
        tags                           = {
            "backend"     = "c4containers"
            "environment" = "staging"
            "system"      = "core"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.core_rendering_c4.null_resource.this must be replaced
+/- resource "null_resource" "this" {
      ~ id       = "5911690965036928812" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "md5"  = "a72acfbf114d8a651464729463f105dd" -> "fc3cebc41b753c676d33484b14b51d60"
          ~ "name" = "core-rendering-c4-stg-a72acfbf114d8a651464729463f105dd.zip" -> "core-rendering-c4-stg-fc3cebc41b753c676d33484b14b51d60.zip"
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/terraform.tfplan"

```

</details>

*Pusher: @kislerdm, Action: `pull_request`, Workflow: `Deploy:Server`*